                                               Project 1 PDB470S

# **Exercise 1:**

1. 
2.
3.
4.
5.
6.

In [ ]:
#1
A. CREATE

#2
D. >

#3
C. AVG()

#4
D. WHERE

#5
C. TRUNCATE table_name

#6
B. INSERT INTO table_name (column_name) VALUES (new_

#7
C. JOIN

#8
D. None of the Above

#9
C. IS NOT NULL

#10
B. ORDER BY

# **Exercise 2:**

1. 
2.
3.
4.

In [ ]:
#1
C. 3

#2
D. All of the above

#3
A. zoo.insert(2, "snake")

#4
D. All of the above

#5
B. "game" and "thrones" 

#6
C. del phone_book["Siya"]

#7
B. The keys of a dictionary can be accessed using values.

#8
B. len(d)

#9
D. None of the above

#10
D. None of the above

# **Exercise 3:**

1. 
2.
3.
4.

In [ ]:
#1
A. LIKE

#2.
#c
SELECT City 
FROM Weather
WHERE Temperature > 70 AND (Condition = 'sunny' OR Condition = 'cloudy');

#3.
#A
SELECT City 
FROM weather
WHERE Humidity BETWEEN 63 AND 79;

#4
#B
SELECT City 
FROM weather
WHERE Temperature > (SELECT Temperature FROM weather WHERE City = 'Paris');

#5
#D.
SELECT country FROM location WHERE city IN (SELECT city FROM weather
WHERE condition = 'sunny');

#6.
#A
SELECT city FROM weather WHERE temperature BETWEEN 71 AND
89;

#7
#A.
SELECT DISTINCT s.sname FROM sailors s, reserves r WHERE
s.sid = r.sid;

#8
#A.
SELECT DISTINCT b.color FROM boats b, reserves r, sailors
s WHERE s.sname = 'Dustin' AND s.sid = r.sid AND r.bid;

#9.
#B. 
SELECT city FROM weather WHERE temperature > 70 AND
condition = 'sunny';

#10
B. DISTINCT

# **Exercise 4:**

In [ ]:
#write your code here.
#Exercice 1: 

def ReverseString(s):
    return s[::-1]

input_string = "Hello"
reversed_string = ReverseString(input_string)
print(reversed_string)

In [ ]:
#write your code here.
#Exercice 2:

def FindGreatestCommonDivisor(a, b):
    while b:
        a, b = b, a % b
    return a

num1 = 12
num2 = 18
result = FindGreatestCommonDivisor(num1, num2)
print(f"The greatest common divisor of {num1} and {num2} is {result}.")

In [ ]:
#write your code here.
#Exercice 3:

def CalculateFactorial(n):
    factorial = 1
    for i in range(1, n + 1):
        factorial *= i
    return factorial

number = 5
result = CalculateFactorial(number)
print(f"The factorial of {number} is {result}.")

# **Exercise 5:**

In [ ]:
#you can copy the codes for your SQL Queries here

#1.

SELECT name, salary 
FROM employees
WHERE salary BETWEEN 9000 AND 10000;


#2.
SELECT name, salary, department_id 
FROM employees
WHERE salary > 8000;

#3.
SELECT name 
FROM employees
WHERE department_id = (SELECT id FROM departments WHERE name = 'Sales');

#4.
SELECT name, salary 
FROM employees
WHERE hire_date < '1987-09-01';

#5.
SELECT name, salary 
FROM employees
WHERE (department_id, salary) IN (
    SELECT department_id, MAX(salary)
    FROM employees
    GROUP BY department_id
);

#6.
SELECT department_id, AVG(salary) as average_salary 
FROM employees
GROUP BY department_id;

#7.
SELECT department_id, COUNT(*) as total_employees 
FROM employees
GROUP BY department_id;

#8.
SELECT e.name, e.salary 
FROM employees e, employees m
WHERE e.manager_id = m.id AND m.salary > e.salary;

#9.
SELECT * 
FROM employees
WHERE first_name LIKE '%D%' OR first_name LIKE '%S%' OR first_name LIKE '%N%'
ORDER BY salary DESC;

#10
SELECT CONCAT(first_name, ' ', last_name) as full_name, hire_date, salary, department_id 
FROM employees;